Revit 2017 API
PipeSettings.SetPressLossCalculationServerInfo Method
 Set the MEPServerInfo of the current pipe pressure loss calculation server.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2012
Syntax
C#
public void SetPressLossCalculationServerInfo(
	MEPCalculationServerInfo serverInfo
)
Visual Basic
Public Sub SetPressLossCalculationServerInfo ( _
	serverInfo As MEPCalculationServerInfo _
)
Visual C++
public:
void SetPressLossCalculationServerInfo(
	MEPCalculationServerInfo^ serverInfo
)
Parameters
serverInfo
Type: Autodesk.Revit.DB.MEPCalculationServerInfo
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace